# Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя несколько чисел и строк и
# сохраните в переменные, выведите на экран
# Часть 1 - присваивание и вывод переменных
a = 10
b = 20
c = 100
d = 'Часть 1 - Присваивание и вывод переменных'
print(d)
print('Переменная a =', a, ';', 'Переменная b =', b, ';', 'Переменная b =', c)

# Часть 2 - запрос переменных у пользователя
e = 'Часть 2 - запрос переменных у пользователя'
print(e)
name = input('Введите ваше имя ')
age = int(input('Введите ваш возраст арабскими цифрами '))
print('Ваше имя = ', name, ';', 'Ваш возраст = ', age)
